# Возвести первые 10 натуральных чисел в квадрат
list(map(lambda x: x ** 2, range(1, 11)))  # правильно
# [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

# list(map(lambda x: x ** 2; x + 1, range(1, 11)))  #  неправильно, так как lambda содержит две конструкции

# (вес, рост)
data = [
   (82, 191),
   (68, 174),
   (90, 189),
   (73, 179),
   (76, 184)
]

print(list((x, x[0] / (x[1]/100)**2) for x in data))
print(sorted(data, key=lambda x: x[0] / (x[1]/100)**2))
print(min(data, key=lambda x: x[0] / (x[1] / 100) ** 2))  # отбор по ключу



